#+title: Stepping on Stage 4: Pull and Re(start/factor)
#+date: <2023-03-15 14:57>
#+description: No idea where this will end
#+filetags: Guile Gerbil Gambit

* Restarted Intro

Yesterday I managed to get everything working on my end. There was a minor error in upstream which git says is taken care of!

Sleep is a good thing, especially when on a later timezone :)

#+begin_src sh :session state-stage4 :results verbatim :wrap example
  if [[ -z "$STATE_CHAN_SRC" ]]; then
   export STATE_CHAN_SRC=$(cd ../.. && pwd)
  fi;
  export GERBIL_LOADPATH=$STATE_CHAN_SRC
  cd $STATE_CHAN_SRC
#+end_src

#+RESULTS:
#+begin_example
#+end_example

